{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# https://www.kernix.com/blog/an-efficient-recommender-system-based-on-graph-database_p9"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "import matplotlib as plt\n",
    "from tqdm import tqdm\n",
    "from py2neo import Graph\n",
    "import pickle\n",
    "from os import path\n",
    "import time\n",
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "process_directory = '../data/processed'\n",
    "if path.exists(process_directory + '/' + 'repos.pkl'):\n",
    "    with open(process_directory + '/' + 'repos.pkl', 'rb') as f:\n",
    "        repo_set = pickle.load(f)        \n",
    "else:\n",
    "    repo_set = set()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "754488"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(repo_set)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "process_directory = '../data/processed'\n",
    "if path.exists(process_directory + '/' + 'users.pkl'):\n",
    "    with open(process_directory + '/' + 'users.pkl', 'rb') as f:\n",
    "        user_set = pickle.load(f)        \n",
    "else:\n",
    "    repo_set = set()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "589035"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(user_set)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "[r for r in repo_set if r[0] == 843222]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_graph_db():\n",
    "    #Still need to figure out if it's possible to launch neo4j from python.\n",
    "    graph = Graph('http://neo4j:neo4j@localhost:11003/db/data/', auth=(\"neo4j\", \"saveme\"))\n",
    "    #create user and repo node constraint\n",
    "    graph.run('CREATE INDEX ON :User(user_id)')\n",
    "    graph.run('CREATE INDEX ON :Repo(repo_id)')\n",
    "    return graph\n",
    "\n",
    "def store_in_graph_db(date, graph_db, process_directory):\n",
    "    triplets = pd.read_csv(process_directory + '/' + date + '/triplets.csv')\n",
    "    users = pd.read_csv(process_directory + '/' + date + '/users.csv')\n",
    "    repos = pd.read_csv(process_directory + '/' + date + '/repos.csv')\n",
    "    if path.exists(process_directory + '/' + 'users.pkl'):\n",
    "        with open(process_directory + '/' + 'users.pkl', 'rb') as f:\n",
    "            user_set = pickle.load(f)        \n",
    "    else:\n",
    "        user_set = set()\n",
    "\n",
    "    if path.exists(process_directory + '/' + 'repos.pkl'):\n",
    "        with open(process_directory + '/' + 'repos.pkl', 'rb') as f:\n",
    "            repo_set = pickle.load(f)        \n",
    "    else:\n",
    "        repo_set = set()\n",
    "    \n",
    "#     tx = graph.begin(autocommit=False)\n",
    "#     user_statement = \"MERGE (a:`User`{user_id:{A}, user_name:{B}}) RETURN a\"\n",
    "#     for i, row in tqdm(users.iterrows(), total = len(users)):\n",
    "#         user_id = row['user_id']\n",
    "#         user_name = row['user_name']\n",
    "#         if (user_id, user_name) not in user_set:\n",
    "#             user_set.add((user_id, user_name))\n",
    "#             tx.run(user_statement, {\"A\": user_id, \"B\": user_name})\n",
    "#             if i % 200 == 0:\n",
    "#                 tx.process()\n",
    "#     tx.commit()\n",
    "\n",
    "#     with open(process_directory + '/' + 'users.pkl', 'wb') as f:\n",
    "#         pickle.dump(user_set, f)     \n",
    "    \n",
    "#     tx = graph.begin(autocommit=False)\n",
    "#     repo_statement = \"MERGE (a:`Repo`{repo_id:{A}, repo_name:{B}}) RETURN a\"\n",
    "#     for i, row in tqdm(repos.iterrows(), total = len(repos)):\n",
    "#         repo_id = row['repo_id']\n",
    "#         repo_name = row['repo_name']\n",
    "#         if (repo_id, repo_name) not in repo_set:\n",
    "#             repo_set.add((repo_id, repo_name))\n",
    "#             tx.run(repo_statement, {\"A\": repo_id, \"B\": repo_name})\n",
    "#             if i % 200 == 0:\n",
    "#                 tx.process()\n",
    "#     tx.commit()\n",
    "#     with open(process_directory + '/' + 'repos.pkl', 'wb') as f:\n",
    "#         pickle.dump(repo_set, f)     \n",
    "    \n",
    "    tx = graph.begin(autocommit=False)\n",
    "    edge_statement1 = (\"MATCH (u:`User`{user_id:{A}}) \"\n",
    "                         \"MATCH (r:`Repo`{repo_id:{B}}) MERGE (u)-[e:`\")\n",
    "    edge_statement2 =  \"`{date:{C}}]->(r) RETURN e\"\n",
    "    for i, row in tqdm(triplets.iterrows(), total = len(triplets)) :\n",
    "        edge_statement = edge_statement1 + row['event_type'] + edge_statement2\n",
    "        tx.run(edge_statement, {\"A\": row['user_id'], \"B\": row['repo_id'], \"C\": date})\n",
    "        if i % 200 == 0:\n",
    "            tx.process()\n",
    "    tx.commit()\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2019-10-02\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 1968591/1968591 [55:26<00:00, 591.78it/s]  \n"
     ]
    }
   ],
   "source": [
    "create_graph = False\n",
    "if create_graph:\n",
    "    graph = create_graph_db()\n",
    "else: \n",
    "    graph = Graph('http://neo4j:neo4j@localhost:11003/db/data/', auth=(\"neo4j\", \"saveme\"))\n",
    "\n",
    "# for date in ['2019-10-01', '2019-10-02']:\n",
    "for date in ['2019-10-02']:\n",
    "    print(date)\n",
    "    store_in_graph_db(date, graph, '../data/processed/')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "triplets = pd.read_csv('../data/processed/2019-10-01/triplets.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1984662, 5)"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>56006075</td>\n",
       "      <td>abbi2019-1776875</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>211975219</td>\n",
       "      <td>abbi2019-1776875/abbi2019-1776875.github.io</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>2333883</td>\n",
       "      <td>jancajthaml</td>\n",
       "      <td>CreateEvent</td>\n",
       "      <td>125103867</td>\n",
       "      <td>jancajthaml-openbank/health-check</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>32782481</td>\n",
       "      <td>vascor1</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>106878356</td>\n",
       "      <td>vascor1/vascor1.github.io</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>29764541</td>\n",
       "      <td>jeronimo-schreyer</td>\n",
       "      <td>PullRequestEvent</td>\n",
       "      <td>15634981</td>\n",
       "      <td>godotengine/godot</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>48139682</td>\n",
       "      <td>sjcondon</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>211766257</td>\n",
       "      <td>sjcondon/school-domain-online-web-pt-090819</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    user_id          user_name        event_type    repo_id  \\\n",
       "0  56006075   abbi2019-1776875         PushEvent  211975219   \n",
       "1   2333883        jancajthaml       CreateEvent  125103867   \n",
       "2  32782481            vascor1         PushEvent  106878356   \n",
       "3  29764541  jeronimo-schreyer  PullRequestEvent   15634981   \n",
       "4  48139682           sjcondon         PushEvent  211766257   \n",
       "\n",
       "                                     repo_name  \n",
       "0  abbi2019-1776875/abbi2019-1776875.github.io  \n",
       "1            jancajthaml-openbank/health-check  \n",
       "2                    vascor1/vascor1.github.io  \n",
       "3                            godotengine/godot  \n",
       "4  sjcondon/school-domain-online-web-pt-090819  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>532381</td>\n",
       "      <td>100</td>\n",
       "      <td>kmarsh</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>186024298</td>\n",
       "      <td>nushell/nushell</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        user_id user_name  event_type    repo_id        repo_name\n",
       "532381      100    kmarsh  WatchEvent  186024298  nushell/nushell"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets.user_id == 100]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>270931</td>\n",
       "      <td>7001637</td>\n",
       "      <td>tidus2102</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        user_id  user_name  event_type  repo_id            repo_name\n",
       "270931  7001637  tidus2102  WatchEvent  6761380  vitalets/x-editable"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets.repo_id == 6761380]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>1767</td>\n",
       "      <td>21957446</td>\n",
       "      <td>pytorchbot</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>65600975</td>\n",
       "      <td>pytorch/pytorch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2599</td>\n",
       "      <td>7608630</td>\n",
       "      <td>xush6528</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>65600975</td>\n",
       "      <td>pytorch/pytorch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2684</td>\n",
       "      <td>7608630</td>\n",
       "      <td>xush6528</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>65600975</td>\n",
       "      <td>pytorch/pytorch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2758</td>\n",
       "      <td>7608630</td>\n",
       "      <td>xush6528</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>65600975</td>\n",
       "      <td>pytorch/pytorch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3645</td>\n",
       "      <td>20346844</td>\n",
       "      <td>ceyzaguirre4</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>211686877</td>\n",
       "      <td>ceyzaguirre4/mac-network-pytorch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1983475</td>\n",
       "      <td>39814207</td>\n",
       "      <td>pull[bot]</td>\n",
       "      <td>PullRequestEvent</td>\n",
       "      <td>119666381</td>\n",
       "      <td>Pandinosaurus/pytorch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1983520</td>\n",
       "      <td>23072278</td>\n",
       "      <td>daejungkim</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>173498120</td>\n",
       "      <td>Daniil-Osokin/lightweight-human-pose-estimatio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1983577</td>\n",
       "      <td>9958665</td>\n",
       "      <td>pritamdamania87</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>65600975</td>\n",
       "      <td>pytorch/pytorch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1983628</td>\n",
       "      <td>9958665</td>\n",
       "      <td>pritamdamania87</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>65600975</td>\n",
       "      <td>pytorch/pytorch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1983689</td>\n",
       "      <td>9958665</td>\n",
       "      <td>pritamdamania87</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>65600975</td>\n",
       "      <td>pytorch/pytorch</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2628 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          user_id        user_name        event_type    repo_id  \\\n",
       "1767     21957446       pytorchbot         PushEvent   65600975   \n",
       "2599      7608630         xush6528         PushEvent   65600975   \n",
       "2684      7608630         xush6528         PushEvent   65600975   \n",
       "2758      7608630         xush6528         PushEvent   65600975   \n",
       "3645     20346844     ceyzaguirre4         PushEvent  211686877   \n",
       "...           ...              ...               ...        ...   \n",
       "1983475  39814207        pull[bot]  PullRequestEvent  119666381   \n",
       "1983520  23072278       daejungkim        WatchEvent  173498120   \n",
       "1983577   9958665  pritamdamania87         PushEvent   65600975   \n",
       "1983628   9958665  pritamdamania87         PushEvent   65600975   \n",
       "1983689   9958665  pritamdamania87         PushEvent   65600975   \n",
       "\n",
       "                                                 repo_name  \n",
       "1767                                       pytorch/pytorch  \n",
       "2599                                       pytorch/pytorch  \n",
       "2684                                       pytorch/pytorch  \n",
       "2758                                       pytorch/pytorch  \n",
       "3645                      ceyzaguirre4/mac-network-pytorch  \n",
       "...                                                    ...  \n",
       "1983475                              Pandinosaurus/pytorch  \n",
       "1983520  Daniil-Osokin/lightweight-human-pose-estimatio...  \n",
       "1983577                                    pytorch/pytorch  \n",
       "1983628                                    pytorch/pytorch  \n",
       "1983689                                    pytorch/pytorch  \n",
       "\n",
       "[2628 rows x 5 columns]"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets['repo_name'].str.contains('pytorch')]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>69035</td>\n",
       "      <td>5697227</td>\n",
       "      <td>ayush987goyal</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>26066727</td>\n",
       "      <td>knsv/mermaid</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>82852</td>\n",
       "      <td>462244</td>\n",
       "      <td>rhz</td>\n",
       "      <td>IssueCommentEvent</td>\n",
       "      <td>26066727</td>\n",
       "      <td>knsv/mermaid</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>113320</td>\n",
       "      <td>24523235</td>\n",
       "      <td>anlei-fu</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>26066727</td>\n",
       "      <td>knsv/mermaid</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>144415</td>\n",
       "      <td>5067153</td>\n",
       "      <td>saanobhaai</td>\n",
       "      <td>CreateEvent</td>\n",
       "      <td>190568677</td>\n",
       "      <td>data-mermaid/mermaid-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>144752</td>\n",
       "      <td>5067153</td>\n",
       "      <td>saanobhaai</td>\n",
       "      <td>PullRequestEvent</td>\n",
       "      <td>190568677</td>\n",
       "      <td>data-mermaid/mermaid-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1882152</td>\n",
       "      <td>6288799</td>\n",
       "      <td>tienhoah</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>188250918</td>\n",
       "      <td>data-mermaid/mermaid-dash</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1886107</td>\n",
       "      <td>6288799</td>\n",
       "      <td>tienhoah</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>188250918</td>\n",
       "      <td>data-mermaid/mermaid-dash</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1887554</td>\n",
       "      <td>1131070</td>\n",
       "      <td>juancri</td>\n",
       "      <td>IssuesEvent</td>\n",
       "      <td>185192018</td>\n",
       "      <td>tomoyukim/vscode-mermaid-editor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1892624</td>\n",
       "      <td>1131070</td>\n",
       "      <td>juancri</td>\n",
       "      <td>IssuesEvent</td>\n",
       "      <td>185192018</td>\n",
       "      <td>tomoyukim/vscode-mermaid-editor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1938135</td>\n",
       "      <td>19863009</td>\n",
       "      <td>rquadri</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>26066727</td>\n",
       "      <td>knsv/mermaid</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>160 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          user_id      user_name         event_type    repo_id  \\\n",
       "69035     5697227  ayush987goyal         WatchEvent   26066727   \n",
       "82852      462244            rhz  IssueCommentEvent   26066727   \n",
       "113320   24523235       anlei-fu         WatchEvent   26066727   \n",
       "144415    5067153     saanobhaai        CreateEvent  190568677   \n",
       "144752    5067153     saanobhaai   PullRequestEvent  190568677   \n",
       "...           ...            ...                ...        ...   \n",
       "1882152   6288799       tienhoah          PushEvent  188250918   \n",
       "1886107   6288799       tienhoah          PushEvent  188250918   \n",
       "1887554   1131070        juancri        IssuesEvent  185192018   \n",
       "1892624   1131070        juancri        IssuesEvent  185192018   \n",
       "1938135  19863009        rquadri         WatchEvent   26066727   \n",
       "\n",
       "                               repo_name  \n",
       "69035                       knsv/mermaid  \n",
       "82852                       knsv/mermaid  \n",
       "113320                      knsv/mermaid  \n",
       "144415          data-mermaid/mermaid-api  \n",
       "144752          data-mermaid/mermaid-api  \n",
       "...                                  ...  \n",
       "1882152        data-mermaid/mermaid-dash  \n",
       "1886107        data-mermaid/mermaid-dash  \n",
       "1887554  tomoyukim/vscode-mermaid-editor  \n",
       "1892624  tomoyukim/vscode-mermaid-editor  \n",
       "1938135                     knsv/mermaid  \n",
       "\n",
       "[160 rows x 5 columns]"
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets['repo_name'].str.contains('mermaid')]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "user_id\n",
       "100         1\n",
       "118         1\n",
       "137         1\n",
       "160         5\n",
       "185         1\n",
       "           ..\n",
       "10367163    1\n",
       "10367166    1\n",
       "10367239    1\n",
       "10367292    1\n",
       "10367421    1\n",
       "Name: user_id, Length: 12548, dtype: int64"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets.event_type == 'WatchEvent'].groupby(['user_id'])['user_id'].count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>50853</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>4920442</td>\n",
       "      <td>congmo/jQuery-Tags-Input</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>51437</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>11534941</td>\n",
       "      <td>TimSchlechter/bootstrap-tagsinput</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>51675</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>1606665</td>\n",
       "      <td>xoxco/jQuery-Tags-Input</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>51781</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>11686981</td>\n",
       "      <td>sliptree/bootstrap-tokenfield</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>59662</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>2715671</td>\n",
       "      <td>fancyapps/fancyBox</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73165</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>1211978</td>\n",
       "      <td>metafizzy/isotope</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73172</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>1308789</td>\n",
       "      <td>javve/list.js</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73180</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>9775802</td>\n",
       "      <td>patrickkunka/mixitup</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73181</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>3598373</td>\n",
       "      <td>square/crossfilter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73344</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>5435483</td>\n",
       "      <td>Schepp/CSS-Filters-Polyfill</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>93 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       user_id user_name  event_type   repo_id  \\\n",
       "50853  7576559  wakaryry  WatchEvent   4920442   \n",
       "51437  7576559  wakaryry  WatchEvent  11534941   \n",
       "51675  7576559  wakaryry  WatchEvent   1606665   \n",
       "51781  7576559  wakaryry  WatchEvent  11686981   \n",
       "59662  7576559  wakaryry  WatchEvent   2715671   \n",
       "...        ...       ...         ...       ...   \n",
       "73165  7576559  wakaryry  WatchEvent   1211978   \n",
       "73172  7576559  wakaryry  WatchEvent   1308789   \n",
       "73180  7576559  wakaryry  WatchEvent   9775802   \n",
       "73181  7576559  wakaryry  WatchEvent   3598373   \n",
       "73344  7576559  wakaryry  WatchEvent   5435483   \n",
       "\n",
       "                               repo_name  \n",
       "50853           congmo/jQuery-Tags-Input  \n",
       "51437  TimSchlechter/bootstrap-tagsinput  \n",
       "51675            xoxco/jQuery-Tags-Input  \n",
       "51781      sliptree/bootstrap-tokenfield  \n",
       "59662                 fancyapps/fancyBox  \n",
       "...                                  ...  \n",
       "73165                  metafizzy/isotope  \n",
       "73172                      javve/list.js  \n",
       "73180               patrickkunka/mixitup  \n",
       "73181                 square/crossfilter  \n",
       "73344        Schepp/CSS-Filters-Polyfill  \n",
       "\n",
       "[93 rows x 5 columns]"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets.user_id == 7576559]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [],
   "source": [
    "users = pd.read_csv('../data/processed/2019-10-01/users.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "367698"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(users)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_set = set(tuple(x) for x in users[['user_id', 'user_name']].values)\n",
    "with open('../data/processed/users.pkl', 'wb') as f:\n",
    "    pickle.dump(user_set, f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>CheckRunEvent</th>\n",
       "      <th>CheckSuiteEvent</th>\n",
       "      <th>CommitCommentEvent</th>\n",
       "      <th>ContentReferenceEvent</th>\n",
       "      <th>CreateEvent</th>\n",
       "      <th>DeleteEvent</th>\n",
       "      <th>DeployKeyEvent</th>\n",
       "      <th>DeploymentEvent</th>\n",
       "      <th>...</th>\n",
       "      <th>RepositoryDispatchEvent</th>\n",
       "      <th>RepositoryEvent</th>\n",
       "      <th>RepositoryImportEvent</th>\n",
       "      <th>RepositoryVulnerabilityAlertEvent</th>\n",
       "      <th>SecurityAdvisoryEvent</th>\n",
       "      <th>StarEvent</th>\n",
       "      <th>StatusEvent</th>\n",
       "      <th>TeamEvent</th>\n",
       "      <th>TeamAddEvent</th>\n",
       "      <th>WatchEvent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>evanphx</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>17.0</td>\n",
       "      <td>vanpelt</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>26.0</td>\n",
       "      <td>topfunky</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>29.0</td>\n",
       "      <td>lukas</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>45.0</td>\n",
       "      <td>mojodna</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 51 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   user_id user_name  CheckRunEvent  CheckSuiteEvent  CommitCommentEvent  \\\n",
       "0      7.0   evanphx            0.0              0.0                 0.0   \n",
       "1     17.0   vanpelt            0.0              0.0                 0.0   \n",
       "2     26.0  topfunky            0.0              0.0                 0.0   \n",
       "3     29.0     lukas            0.0              0.0                 0.0   \n",
       "4     45.0   mojodna            0.0              0.0                 1.0   \n",
       "\n",
       "   ContentReferenceEvent  CreateEvent  DeleteEvent  DeployKeyEvent  \\\n",
       "0                    0.0          0.0          0.0             0.0   \n",
       "1                    0.0          0.0          0.0             0.0   \n",
       "2                    0.0          0.0          0.0             0.0   \n",
       "3                    0.0          1.0          0.0             0.0   \n",
       "4                    0.0          0.0          0.0             0.0   \n",
       "\n",
       "   DeploymentEvent  ...  RepositoryDispatchEvent  RepositoryEvent  \\\n",
       "0              0.0  ...                      0.0              0.0   \n",
       "1              0.0  ...                      0.0              0.0   \n",
       "2              0.0  ...                      0.0              0.0   \n",
       "3              0.0  ...                      0.0              0.0   \n",
       "4              0.0  ...                      0.0              0.0   \n",
       "\n",
       "   RepositoryImportEvent  RepositoryVulnerabilityAlertEvent  \\\n",
       "0                    0.0                                0.0   \n",
       "1                    0.0                                0.0   \n",
       "2                    0.0                                0.0   \n",
       "3                    0.0                                0.0   \n",
       "4                    0.0                                0.0   \n",
       "\n",
       "   SecurityAdvisoryEvent  StarEvent  StatusEvent  TeamEvent  TeamAddEvent  \\\n",
       "0                    0.0        0.0          0.0        0.0           0.0   \n",
       "1                    0.0        0.0          0.0        0.0           0.0   \n",
       "2                    0.0        0.0          0.0        0.0           0.0   \n",
       "3                    0.0        0.0          0.0        0.0           0.0   \n",
       "4                    0.0        0.0          0.0        0.0           0.0   \n",
       "\n",
       "   WatchEvent  \n",
       "0         0.0  \n",
       "1         1.0  \n",
       "2         0.0  \n",
       "3         0.0  \n",
       "4         0.0  \n",
       "\n",
       "[5 rows x 51 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "users.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>CheckRunEvent</th>\n",
       "      <th>CheckSuiteEvent</th>\n",
       "      <th>CommitCommentEvent</th>\n",
       "      <th>ContentReferenceEvent</th>\n",
       "      <th>CreateEvent</th>\n",
       "      <th>DeleteEvent</th>\n",
       "      <th>DeployKeyEvent</th>\n",
       "      <th>DeploymentEvent</th>\n",
       "      <th>...</th>\n",
       "      <th>RepositoryDispatchEvent</th>\n",
       "      <th>RepositoryEvent</th>\n",
       "      <th>RepositoryImportEvent</th>\n",
       "      <th>RepositoryVulnerabilityAlertEvent</th>\n",
       "      <th>SecurityAdvisoryEvent</th>\n",
       "      <th>StarEvent</th>\n",
       "      <th>StatusEvent</th>\n",
       "      <th>TeamEvent</th>\n",
       "      <th>TeamAddEvent</th>\n",
       "      <th>WatchEvent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>9809</td>\n",
       "      <td>201798.0</td>\n",
       "      <td>Christian-Kr</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>9810</td>\n",
       "      <td>201798.0</td>\n",
       "      <td>ckrippendorf</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2 rows × 51 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       user_id     user_name  CheckRunEvent  CheckSuiteEvent  \\\n",
       "9809  201798.0  Christian-Kr            0.0              0.0   \n",
       "9810  201798.0  ckrippendorf            0.0              0.0   \n",
       "\n",
       "      CommitCommentEvent  ContentReferenceEvent  CreateEvent  DeleteEvent  \\\n",
       "9809                 0.0                    0.0          0.0          0.0   \n",
       "9810                 0.0                    0.0          0.0          0.0   \n",
       "\n",
       "      DeployKeyEvent  DeploymentEvent  ...  RepositoryDispatchEvent  \\\n",
       "9809             0.0              0.0  ...                      0.0   \n",
       "9810             0.0              0.0  ...                      0.0   \n",
       "\n",
       "      RepositoryEvent  RepositoryImportEvent  \\\n",
       "9809              0.0                    0.0   \n",
       "9810              0.0                    0.0   \n",
       "\n",
       "      RepositoryVulnerabilityAlertEvent  SecurityAdvisoryEvent  StarEvent  \\\n",
       "9809                                0.0                    0.0        0.0   \n",
       "9810                                0.0                    0.0        0.0   \n",
       "\n",
       "      StatusEvent  TeamEvent  TeamAddEvent  WatchEvent  \n",
       "9809          0.0        0.0           0.0         0.0  \n",
       "9810          0.0        0.0           0.0         0.0  \n",
       "\n",
       "[2 rows x 51 columns]"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "users[users.user_id == 201798]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "repos = pd.read_csv('../data/processed/2019-10-02/repos.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "      <th>CheckRunEvent</th>\n",
       "      <th>CheckSuiteEvent</th>\n",
       "      <th>CommitCommentEvent</th>\n",
       "      <th>ContentReferenceEvent</th>\n",
       "      <th>CreateEvent</th>\n",
       "      <th>DeleteEvent</th>\n",
       "      <th>DeployKeyEvent</th>\n",
       "      <th>DeploymentEvent</th>\n",
       "      <th>...</th>\n",
       "      <th>RepositoryDispatchEvent</th>\n",
       "      <th>RepositoryEvent</th>\n",
       "      <th>RepositoryImportEvent</th>\n",
       "      <th>RepositoryVulnerabilityAlertEvent</th>\n",
       "      <th>SecurityAdvisoryEvent</th>\n",
       "      <th>StarEvent</th>\n",
       "      <th>StatusEvent</th>\n",
       "      <th>TeamEvent</th>\n",
       "      <th>TeamAddEvent</th>\n",
       "      <th>WatchEvent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>363</td>\n",
       "      <td>collectiveidea/audited</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>426</td>\n",
       "      <td>haml/haml</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>507</td>\n",
       "      <td>sferik/twitter</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>682</td>\n",
       "      <td>tobi/delayed_job</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>912</td>\n",
       "      <td>collectiveidea/awesome_nested_set</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 51 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   repo_id                          repo_name  CheckRunEvent  CheckSuiteEvent  \\\n",
       "0      363             collectiveidea/audited            0.0              0.0   \n",
       "1      426                          haml/haml            0.0              0.0   \n",
       "2      507                     sferik/twitter            0.0              0.0   \n",
       "3      682                   tobi/delayed_job            0.0              0.0   \n",
       "4      912  collectiveidea/awesome_nested_set            0.0              0.0   \n",
       "\n",
       "   CommitCommentEvent  ContentReferenceEvent  CreateEvent  DeleteEvent  \\\n",
       "0                 0.0                    0.0          0.0          0.0   \n",
       "1                 0.0                    0.0          0.0          0.0   \n",
       "2                 0.0                    0.0          0.0          0.0   \n",
       "3                 0.0                    0.0          0.0          0.0   \n",
       "4                 0.0                    0.0          0.0          0.0   \n",
       "\n",
       "   DeployKeyEvent  DeploymentEvent  ...  RepositoryDispatchEvent  \\\n",
       "0             0.0              0.0  ...                      0.0   \n",
       "1             0.0              0.0  ...                      0.0   \n",
       "2             0.0              0.0  ...                      0.0   \n",
       "3             0.0              0.0  ...                      0.0   \n",
       "4             0.0              0.0  ...                      0.0   \n",
       "\n",
       "   RepositoryEvent  RepositoryImportEvent  RepositoryVulnerabilityAlertEvent  \\\n",
       "0              0.0                    0.0                                0.0   \n",
       "1              0.0                    0.0                                0.0   \n",
       "2              0.0                    0.0                                0.0   \n",
       "3              0.0                    0.0                                0.0   \n",
       "4              0.0                    0.0                                0.0   \n",
       "\n",
       "   SecurityAdvisoryEvent  StarEvent  StatusEvent  TeamEvent  TeamAddEvent  \\\n",
       "0                    0.0        0.0          0.0        0.0           0.0   \n",
       "1                    0.0        0.0          0.0        0.0           0.0   \n",
       "2                    0.0        0.0          0.0        0.0           0.0   \n",
       "3                    0.0        0.0          0.0        0.0           0.0   \n",
       "4                    0.0        0.0          0.0        0.0           0.0   \n",
       "\n",
       "   WatchEvent  \n",
       "0         1.0  \n",
       "1         0.0  \n",
       "2         3.0  \n",
       "3         1.0  \n",
       "4         0.0  \n",
       "\n",
       "[5 rows x 51 columns]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "repos.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# #### Create the user, repo nodes and edges between them\n",
    "# # \"MERGE\" request : creates a new node if it does not exist already\n",
    "\n",
    "# tx = graph.begin(autocommit=False)\n",
    "\n",
    "# user_statement = \"MERGE (a:`User`{user_id:{A}, user_name:{B}}) RETURN a\"\n",
    "# for i, row in tqdm(users.iterrows(), total = len(users)):\n",
    "#     tx.run(user_statement, {\"A\": row['user_id'], \"B\": row['user_name']})\n",
    "# tx.commit()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 66475/66475 [45:21<00:00, 24.43it/s]  \n"
     ]
    }
   ],
   "source": [
    "# tx = graph.begin(autocommit=False)\n",
    "\n",
    "# repo_statement = \"MERGE (a:`Repo`{repo_id:{A}, repo_name:{B}}) RETURN a\"\n",
    "# for i, row in tqdm(repos.iterrows(), total = len(repos)):\n",
    "#     tx.run(repo_statement, {\"A\": row['repo_id'], \"B\": row['repo_name']})\n",
    "# tx.commit()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 218939/218939 [06:59<00:00, 522.12it/s]\n"
     ]
    }
   ],
   "source": [
    "# tx = graph.begin(autocommit=False)\n",
    "\n",
    "# edge_statement1 = (\"MATCH (u:`User`{user_id:{A}}) \"\n",
    "#                      \"MATCH (r:`Repo`{repo_id:{B}}) MERGE (u)-[e:`\")\n",
    "# edge_statement2 =  \"`]->(r) RETURN e\"\n",
    "# for i, row in tqdm(triplets.iterrows(), total = len(triplets)) :\n",
    "#     edge_statement = edge_statement1 + row['event_type'] + edge_statement2\n",
    "#     tx.run(edge_statement, {\"A\": row['user_id'], \"B\": row['repo_id']})\n",
    "#     if i % 200 == 0:\n",
    "#         tx.process()\n",
    "# tx.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x132402d10>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# graph.run('CREATE INDEX ON :User(user_id)')\n",
    "# graph.run('CREATE INDEX ON :Repo(repo_id)')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'u2.user_name': 'comxd', 'sim': 1.0},\n",
       " {'u2.user_name': 'altmer', 'sim': 1.0},\n",
       " {'u2.user_name': 'rajeshmeniya', 'sim': 1.0}]"
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_id = 100\n",
    "threshold = 0.5\n",
    "\n",
    "# In Strategy 1, the similarity between two users u1 and u2 is the proportion of starred repos they have in common\n",
    "# The score of one given movie m is the proportion of users similar to u1 who rated m\n",
    "\n",
    "query = (### Similarity normalization : count number of repos starred by u1 ###\n",
    "  # Count movies rated by u1 as countm\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`WatchEvent`]->(r1:`Repo`) '\n",
    "  'WITH count(r1) as count1 '\n",
    "  ### Score normalization : count number of users who are considered similar to u1 ###\n",
    "  # Retrieve all users u2 who share at least one starred repo with u1\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`WatchEvent`]->(r1:`Repo`) '\n",
    "  'MATCH (r1)<-[w:`WatchEvent`]-(u2:`User`) '\n",
    "  'WHERE NOT u2=u1 '\n",
    "  # Compute similarity\n",
    "  'WITH u2, count1, tofloat(count(w)) / count1 as sim '\n",
    "  # Keep users u2 whose similarity with u1 is above some threshold\n",
    "#   'WHERE sim>{threshold} '\n",
    "  # Compute score and return the list of suggestions ordered by score\n",
    "  'RETURN DISTINCT u2.user_name, sim ORDER BY sim DESC ')\n",
    "  \n",
    "tx = graph.begin()\n",
    "result = tx.run(query, {'user_id': user_id, 'threshold': threshold}).data()\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Similar libraries to pytorch\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'r2.repo_name': 'tensorflow/tensorflow', 'sim': 9.0},\n",
       " {'r2.repo_name': 'keras-team/keras', 'sim': 4.0},\n",
       " {'r2.repo_name': 'opencv/opencv', 'sim': 4.0},\n",
       " {'r2.repo_name': 'pandas-dev/pandas', 'sim': 3.0},\n",
       " {'r2.repo_name': 'apache/incubator-mxnet', 'sim': 3.0},\n",
       " {'r2.repo_name': 'laravel/laravel', 'sim': 2.0},\n",
       " {'r2.repo_name': 'vuejs/vue', 'sim': 1.0},\n",
       " {'r2.repo_name': 'galihx11/dotfiles', 'sim': 1.0},\n",
       " {'r2.repo_name': 'netblue30/firetools', 'sim': 1.0},\n",
       " {'r2.repo_name': 'tensorflow/io', 'sim': 1.0}]"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start = time.time()\n",
    "# #sklearn\n",
    "# repo_id = 843222\n",
    "# #pytorch\n",
    "repo_id = 65600975\n",
    "#mermaid-js\n",
    "# repo_id = 26066727\n",
    "threshold = 1\n",
    "\n",
    "# Find similar repos\n",
    "\n",
    "query = (### Similarity normalization : count number of repos starred by u1 ###\n",
    "  # Count movies rated by u1 as countm\n",
    "  'MATCH (u1:`User`)-[:`WatchEvent`]->(r1:`Repo` {repo_id: {repo_id}}) '\n",
    "  'WITH count(u1) as count1 '\n",
    "  ### Score normalization : count number of users who are considered similar to u1 ###\n",
    "  # Retrieve all users u2 who share at least one starred repo with u1\n",
    "  'MATCH (u1:`User`)-[:`WatchEvent`]->(r1:`Repo` {repo_id: {repo_id}}) '\n",
    "  'MATCH (r2:`Repo`)<-[w:`WatchEvent`]-(u1) '\n",
    "  'WHERE NOT r1=r2 '\n",
    "  # Compute similarity\n",
    "#   'WITH r2, count1, tofloat(count(w)) / count1 as sim '\n",
    "  'WITH r2, count1, tofloat(count(w)) as sim '\n",
    "  # Keep users u2 whose similarity with u1 is above some threshold\n",
    "  'WHERE sim>={threshold} '\n",
    "  # Compute score and return the list of suggestions ordered by score\n",
    "  'RETURN DISTINCT r2.repo_name, sim ORDER BY sim DESC ')\n",
    "  \n",
    "tx = graph.begin()\n",
    "result = tx.run(query, {'repo_id': repo_id, 'threshold': threshold}).data()\n",
    "print(\"Similar libraries to pytorch\")\n",
    "result[:10]\n",
    "\n",
    "# end = time.time()\n",
    "# end-start"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "threshold = 0.5\n",
    "\n",
    "# In Strategy 1, the similarity between two users u1 and u2 is the proportion of starred repos they have in common\n",
    "# The score of one given movie m is the proportion of users similar to u1 who rated m\n",
    "\n",
    "query = (### Similarity normalization : count number of repos starred by u1 ###\n",
    "  # Count movies rated by u1 as countm\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`WatchEvent`]->(r1:`Repo`) '\n",
    "  'WITH count(r1) as count1 '\n",
    "  ### Score normalization : count number of users who are considered similar to u1 ###\n",
    "  # Retrieve all users u2 who share at least one starred repo with u1\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`WatchEvent`]->(r1:`Repo`) '\n",
    "  'MATCH (r1)<-[w:`WatchEvent`]-(u2:`User`) '\n",
    "  'WHERE NOT u2=u1 '\n",
    "  # Compute similarity\n",
    "  'WITH u2, count1, tofloat(count(w))/count1 as sim '\n",
    "  # Keep users u2 whose similarity with u1 is above some threshold\n",
    "  'WHERE sim>{threshold} '\n",
    "  # Count number of similar users as countu\n",
    "  'WITH count(u2) as count2, count1 '\n",
    "  ### Recommendation ###\n",
    "  # Retrieve all users u2 who share at least one movie with u1\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`Has_rated`]->(m1:`Movie`) '\n",
    "  'MATCH (m1)<-[r:`Has_rated`]-(u2:`User`) '\n",
    "  'WHERE NOT u2=u1 '\n",
    "  # Compute similarity\n",
    "  'WITH u1, u2,countu, tofloat(count(r))/countm as sim '\n",
    "  # Keep users u2 whose similarity with u1 is above some threshold\n",
    "  'WHERE sim>{threshold} '\n",
    "  # Retrieve movies m that were rated by at least one similar user, but not by u1\n",
    "  'MATCH (m:`Movie`)<-[r:`Has_rated`]-(u2) '\n",
    "  'WHERE NOT (m)<-[:`Has_rated`]-(u1) '\n",
    "  # Compute score and return the list of suggestions ordered by score\n",
    "  'RETURN DISTINCT m, tofloat(count(r))/countu as score ORDER BY score DESC ')\n",
    "tx = graph.cypher.begin()\n",
    "tx.append(query, {'user_id': user_id, 'threshold': threshold})\n",
    "result = tx.commit()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (mit)",
   "language": "python",
   "name": "mit"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
