{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# https://www.kernix.com/blog/an-efficient-recommender-system-based-on-graph-database_p9"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "import matplotlib as plt\n",
    "from tqdm import tqdm\n",
    "from py2neo import Graph\n",
    "import time\n",
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph('http://neo4j:neo4j@localhost:7474/db/data/', auth=(\"neo4j\", \"saveme\"))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "triplets = pd.read_csv('../data/processed/2015-01-01/triplets.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>9152315</td>\n",
       "      <td>davidjhulse</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>28635890</td>\n",
       "      <td>davidjhulse/davesbingrewardsbot</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>5581438</td>\n",
       "      <td>jmoon018</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>26392647</td>\n",
       "      <td>jmoon018/rshell-unit-tester</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>6352424</td>\n",
       "      <td>christoferpeterson</td>\n",
       "      <td>CreateEvent</td>\n",
       "      <td>28677542</td>\n",
       "      <td>christoferpeterson/Vadek</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>66577</td>\n",
       "      <td>JakeWharton</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>5152285</td>\n",
       "      <td>square/okhttp</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>9221683</td>\n",
       "      <td>git4ruby</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>28520835</td>\n",
       "      <td>git4ruby/movie_review1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   user_id           user_name   event_type   repo_id  \\\n",
       "0  9152315         davidjhulse    PushEvent  28635890   \n",
       "1  5581438            jmoon018    PushEvent  26392647   \n",
       "2  6352424  christoferpeterson  CreateEvent  28677542   \n",
       "3    66577         JakeWharton    PushEvent   5152285   \n",
       "4  9221683            git4ruby    PushEvent  28520835   \n",
       "\n",
       "                         repo_name  \n",
       "0  davidjhulse/davesbingrewardsbot  \n",
       "1      jmoon018/rshell-unit-tester  \n",
       "2         christoferpeterson/Vadek  \n",
       "3                    square/okhttp  \n",
       "4           git4ruby/movie_review1  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>112498</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>120832</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>IssuesEvent</td>\n",
       "      <td>28639477</td>\n",
       "      <td>servesimple/servesimple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>120834</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>28639477</td>\n",
       "      <td>servesimple/servesimple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>132081</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>28639477</td>\n",
       "      <td>servesimple/servesimple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>133709</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>28639477</td>\n",
       "      <td>servesimple/servesimple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>136178</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>28639477</td>\n",
       "      <td>servesimple/servesimple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>159344</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>28639477</td>\n",
       "      <td>servesimple/servesimple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>161029</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>28639477</td>\n",
       "      <td>servesimple/servesimple</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        user_id       user_name   event_type   repo_id  \\\n",
       "112498      100  willcodeforfoo   WatchEvent   6761380   \n",
       "120832      100  willcodeforfoo  IssuesEvent  28639477   \n",
       "120834      100  willcodeforfoo    PushEvent  28639477   \n",
       "132081      100  willcodeforfoo    PushEvent  28639477   \n",
       "133709      100  willcodeforfoo    PushEvent  28639477   \n",
       "136178      100  willcodeforfoo    PushEvent  28639477   \n",
       "159344      100  willcodeforfoo    PushEvent  28639477   \n",
       "161029      100  willcodeforfoo    PushEvent  28639477   \n",
       "\n",
       "                      repo_name  \n",
       "112498      vitalets/x-editable  \n",
       "120832  servesimple/servesimple  \n",
       "120834  servesimple/servesimple  \n",
       "132081  servesimple/servesimple  \n",
       "133709  servesimple/servesimple  \n",
       "136178  servesimple/servesimple  \n",
       "159344  servesimple/servesimple  \n",
       "161029  servesimple/servesimple  "
      ]
     },
     "execution_count": 75,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets.user_id == 100]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>44079</td>\n",
       "      <td>1169532</td>\n",
       "      <td>rajeshmeniya</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>89259</td>\n",
       "      <td>6705413</td>\n",
       "      <td>CapitalEffe</td>\n",
       "      <td>IssuesEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>93702</td>\n",
       "      <td>6705413</td>\n",
       "      <td>CapitalEffe</td>\n",
       "      <td>IssueCommentEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>98585</td>\n",
       "      <td>6705413</td>\n",
       "      <td>CapitalEffe</td>\n",
       "      <td>IssuesEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>98586</td>\n",
       "      <td>6705413</td>\n",
       "      <td>CapitalEffe</td>\n",
       "      <td>IssueCommentEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>99158</td>\n",
       "      <td>6705413</td>\n",
       "      <td>CapitalEffe</td>\n",
       "      <td>IssuesEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>102273</td>\n",
       "      <td>426400</td>\n",
       "      <td>altmer</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>112498</td>\n",
       "      <td>100</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>204108</td>\n",
       "      <td>9022239</td>\n",
       "      <td>comxd</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>205213</td>\n",
       "      <td>9022239</td>\n",
       "      <td>comxd</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>6761380</td>\n",
       "      <td>vitalets/x-editable</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        user_id       user_name         event_type  repo_id  \\\n",
       "44079   1169532    rajeshmeniya         WatchEvent  6761380   \n",
       "89259   6705413     CapitalEffe        IssuesEvent  6761380   \n",
       "93702   6705413     CapitalEffe  IssueCommentEvent  6761380   \n",
       "98585   6705413     CapitalEffe        IssuesEvent  6761380   \n",
       "98586   6705413     CapitalEffe  IssueCommentEvent  6761380   \n",
       "99158   6705413     CapitalEffe        IssuesEvent  6761380   \n",
       "102273   426400          altmer         WatchEvent  6761380   \n",
       "112498      100  willcodeforfoo         WatchEvent  6761380   \n",
       "204108  9022239           comxd         WatchEvent  6761380   \n",
       "205213  9022239           comxd         WatchEvent  6761380   \n",
       "\n",
       "                  repo_name  \n",
       "44079   vitalets/x-editable  \n",
       "89259   vitalets/x-editable  \n",
       "93702   vitalets/x-editable  \n",
       "98585   vitalets/x-editable  \n",
       "98586   vitalets/x-editable  \n",
       "99158   vitalets/x-editable  \n",
       "102273  vitalets/x-editable  \n",
       "112498  vitalets/x-editable  \n",
       "204108  vitalets/x-editable  \n",
       "205213  vitalets/x-editable  "
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets.repo_id == 6761380]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>7651</td>\n",
       "      <td>3696068</td>\n",
       "      <td>kittipatkampa</td>\n",
       "      <td>ForkEvent</td>\n",
       "      <td>843222</td>\n",
       "      <td>scikit-learn/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>9488</td>\n",
       "      <td>4193054</td>\n",
       "      <td>KatherineMichel</td>\n",
       "      <td>ForkEvent</td>\n",
       "      <td>10518207</td>\n",
       "      <td>IssamLaradji/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>15445</td>\n",
       "      <td>78827</td>\n",
       "      <td>jnothman</td>\n",
       "      <td>IssueCommentEvent</td>\n",
       "      <td>843222</td>\n",
       "      <td>scikit-learn/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>15520</td>\n",
       "      <td>78827</td>\n",
       "      <td>jnothman</td>\n",
       "      <td>PullRequestReviewCommentEvent</td>\n",
       "      <td>843222</td>\n",
       "      <td>scikit-learn/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>15604</td>\n",
       "      <td>78827</td>\n",
       "      <td>jnothman</td>\n",
       "      <td>IssueCommentEvent</td>\n",
       "      <td>843222</td>\n",
       "      <td>scikit-learn/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>212424</td>\n",
       "      <td>9487348</td>\n",
       "      <td>ragv</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>26038110</td>\n",
       "      <td>ragv/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>212603</td>\n",
       "      <td>9487348</td>\n",
       "      <td>ragv</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>26038110</td>\n",
       "      <td>ragv/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>212930</td>\n",
       "      <td>9487348</td>\n",
       "      <td>ragv</td>\n",
       "      <td>PushEvent</td>\n",
       "      <td>26038110</td>\n",
       "      <td>ragv/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>213782</td>\n",
       "      <td>2354108</td>\n",
       "      <td>coveralls</td>\n",
       "      <td>IssueCommentEvent</td>\n",
       "      <td>843222</td>\n",
       "      <td>scikit-learn/scikit-learn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>214950</td>\n",
       "      <td>3793823</td>\n",
       "      <td>biwa7636</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>843222</td>\n",
       "      <td>scikit-learn/scikit-learn</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>62 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        user_id        user_name                     event_type   repo_id  \\\n",
       "7651    3696068    kittipatkampa                      ForkEvent    843222   \n",
       "9488    4193054  KatherineMichel                      ForkEvent  10518207   \n",
       "15445     78827         jnothman              IssueCommentEvent    843222   \n",
       "15520     78827         jnothman  PullRequestReviewCommentEvent    843222   \n",
       "15604     78827         jnothman              IssueCommentEvent    843222   \n",
       "...         ...              ...                            ...       ...   \n",
       "212424  9487348             ragv                      PushEvent  26038110   \n",
       "212603  9487348             ragv                      PushEvent  26038110   \n",
       "212930  9487348             ragv                      PushEvent  26038110   \n",
       "213782  2354108        coveralls              IssueCommentEvent    843222   \n",
       "214950  3793823         biwa7636                     WatchEvent    843222   \n",
       "\n",
       "                        repo_name  \n",
       "7651    scikit-learn/scikit-learn  \n",
       "9488    IssamLaradji/scikit-learn  \n",
       "15445   scikit-learn/scikit-learn  \n",
       "15520   scikit-learn/scikit-learn  \n",
       "15604   scikit-learn/scikit-learn  \n",
       "...                           ...  \n",
       "212424          ragv/scikit-learn  \n",
       "212603          ragv/scikit-learn  \n",
       "212930          ragv/scikit-learn  \n",
       "213782  scikit-learn/scikit-learn  \n",
       "214950  scikit-learn/scikit-learn  \n",
       "\n",
       "[62 rows x 5 columns]"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets['repo_name'].str.contains('scikit')]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "user_id\n",
       "100         1\n",
       "118         1\n",
       "137         1\n",
       "160         5\n",
       "185         1\n",
       "           ..\n",
       "10367163    1\n",
       "10367166    1\n",
       "10367239    1\n",
       "10367292    1\n",
       "10367421    1\n",
       "Name: user_id, Length: 12548, dtype: int64"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets.event_type == 'WatchEvent'].groupby(['user_id'])['user_id'].count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>event_type</th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>50853</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>4920442</td>\n",
       "      <td>congmo/jQuery-Tags-Input</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>51437</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>11534941</td>\n",
       "      <td>TimSchlechter/bootstrap-tagsinput</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>51675</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>1606665</td>\n",
       "      <td>xoxco/jQuery-Tags-Input</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>51781</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>11686981</td>\n",
       "      <td>sliptree/bootstrap-tokenfield</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>59662</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>2715671</td>\n",
       "      <td>fancyapps/fancyBox</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73165</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>1211978</td>\n",
       "      <td>metafizzy/isotope</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73172</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>1308789</td>\n",
       "      <td>javve/list.js</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73180</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>9775802</td>\n",
       "      <td>patrickkunka/mixitup</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73181</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>3598373</td>\n",
       "      <td>square/crossfilter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>73344</td>\n",
       "      <td>7576559</td>\n",
       "      <td>wakaryry</td>\n",
       "      <td>WatchEvent</td>\n",
       "      <td>5435483</td>\n",
       "      <td>Schepp/CSS-Filters-Polyfill</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>93 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       user_id user_name  event_type   repo_id  \\\n",
       "50853  7576559  wakaryry  WatchEvent   4920442   \n",
       "51437  7576559  wakaryry  WatchEvent  11534941   \n",
       "51675  7576559  wakaryry  WatchEvent   1606665   \n",
       "51781  7576559  wakaryry  WatchEvent  11686981   \n",
       "59662  7576559  wakaryry  WatchEvent   2715671   \n",
       "...        ...       ...         ...       ...   \n",
       "73165  7576559  wakaryry  WatchEvent   1211978   \n",
       "73172  7576559  wakaryry  WatchEvent   1308789   \n",
       "73180  7576559  wakaryry  WatchEvent   9775802   \n",
       "73181  7576559  wakaryry  WatchEvent   3598373   \n",
       "73344  7576559  wakaryry  WatchEvent   5435483   \n",
       "\n",
       "                               repo_name  \n",
       "50853           congmo/jQuery-Tags-Input  \n",
       "51437  TimSchlechter/bootstrap-tagsinput  \n",
       "51675            xoxco/jQuery-Tags-Input  \n",
       "51781      sliptree/bootstrap-tokenfield  \n",
       "59662                 fancyapps/fancyBox  \n",
       "...                                  ...  \n",
       "73165                  metafizzy/isotope  \n",
       "73172                      javve/list.js  \n",
       "73180               patrickkunka/mixitup  \n",
       "73181                 square/crossfilter  \n",
       "73344        Schepp/CSS-Filters-Polyfill  \n",
       "\n",
       "[93 rows x 5 columns]"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triplets[triplets.user_id == 7576559]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "users = pd.read_csv('../data/processed/2015-01-01/users.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user_id</th>\n",
       "      <th>user_name</th>\n",
       "      <th>CheckRunEvent</th>\n",
       "      <th>CheckSuiteEvent</th>\n",
       "      <th>CommitCommentEvent</th>\n",
       "      <th>ContentReferenceEvent</th>\n",
       "      <th>CreateEvent</th>\n",
       "      <th>DeleteEvent</th>\n",
       "      <th>DeployKeyEvent</th>\n",
       "      <th>DeploymentEvent</th>\n",
       "      <th>...</th>\n",
       "      <th>RepositoryDispatchEvent</th>\n",
       "      <th>RepositoryEvent</th>\n",
       "      <th>RepositoryImportEvent</th>\n",
       "      <th>RepositoryVulnerabilityAlertEvent</th>\n",
       "      <th>SecurityAdvisoryEvent</th>\n",
       "      <th>StarEvent</th>\n",
       "      <th>StatusEvent</th>\n",
       "      <th>TeamEvent</th>\n",
       "      <th>TeamAddEvent</th>\n",
       "      <th>WatchEvent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>evanphx</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>78.0</td>\n",
       "      <td>indirect</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>100.0</td>\n",
       "      <td>willcodeforfoo</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>118.0</td>\n",
       "      <td>peterc</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>129.0</td>\n",
       "      <td>canadaduane</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 51 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   user_id       user_name  CheckRunEvent  CheckSuiteEvent  \\\n",
       "0      7.0         evanphx            0.0              0.0   \n",
       "1     78.0        indirect            0.0              0.0   \n",
       "2    100.0  willcodeforfoo            0.0              0.0   \n",
       "3    118.0          peterc            0.0              0.0   \n",
       "4    129.0     canadaduane            0.0              0.0   \n",
       "\n",
       "   CommitCommentEvent  ContentReferenceEvent  CreateEvent  DeleteEvent  \\\n",
       "0                 0.0                    0.0          0.0          0.0   \n",
       "1                 0.0                    0.0          0.0          0.0   \n",
       "2                 0.0                    0.0          0.0          0.0   \n",
       "3                 0.0                    0.0          0.0          0.0   \n",
       "4                 0.0                    0.0          0.0          0.0   \n",
       "\n",
       "   DeployKeyEvent  DeploymentEvent  ...  RepositoryDispatchEvent  \\\n",
       "0             0.0              0.0  ...                      0.0   \n",
       "1             0.0              0.0  ...                      0.0   \n",
       "2             0.0              0.0  ...                      0.0   \n",
       "3             0.0              0.0  ...                      0.0   \n",
       "4             0.0              0.0  ...                      0.0   \n",
       "\n",
       "   RepositoryEvent  RepositoryImportEvent  RepositoryVulnerabilityAlertEvent  \\\n",
       "0              0.0                    0.0                                0.0   \n",
       "1              0.0                    0.0                                0.0   \n",
       "2              0.0                    0.0                                0.0   \n",
       "3              0.0                    0.0                                0.0   \n",
       "4              0.0                    0.0                                0.0   \n",
       "\n",
       "   SecurityAdvisoryEvent  StarEvent  StatusEvent  TeamEvent  TeamAddEvent  \\\n",
       "0                    0.0        0.0          0.0        0.0           0.0   \n",
       "1                    0.0        0.0          0.0        0.0           0.0   \n",
       "2                    0.0        0.0          0.0        0.0           0.0   \n",
       "3                    0.0        0.0          0.0        0.0           0.0   \n",
       "4                    0.0        0.0          0.0        0.0           0.0   \n",
       "\n",
       "   WatchEvent  \n",
       "0         0.0  \n",
       "1         0.0  \n",
       "2         1.0  \n",
       "3         1.0  \n",
       "4         0.0  \n",
       "\n",
       "[5 rows x 51 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "users.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "repos = pd.read_csv('../data/processed/2015-01-01/repos.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>repo_id</th>\n",
       "      <th>repo_name</th>\n",
       "      <th>CheckRunEvent</th>\n",
       "      <th>CheckSuiteEvent</th>\n",
       "      <th>CommitCommentEvent</th>\n",
       "      <th>ContentReferenceEvent</th>\n",
       "      <th>CreateEvent</th>\n",
       "      <th>DeleteEvent</th>\n",
       "      <th>DeployKeyEvent</th>\n",
       "      <th>DeploymentEvent</th>\n",
       "      <th>...</th>\n",
       "      <th>RepositoryDispatchEvent</th>\n",
       "      <th>RepositoryEvent</th>\n",
       "      <th>RepositoryImportEvent</th>\n",
       "      <th>RepositoryVulnerabilityAlertEvent</th>\n",
       "      <th>SecurityAdvisoryEvent</th>\n",
       "      <th>StarEvent</th>\n",
       "      <th>StatusEvent</th>\n",
       "      <th>TeamEvent</th>\n",
       "      <th>TeamAddEvent</th>\n",
       "      <th>WatchEvent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>rubinius/rubinius</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>6.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>28</td>\n",
       "      <td>mojombo/god</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>68</td>\n",
       "      <td>macournoyer/thin</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>144</td>\n",
       "      <td>mojombo/chronic</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>426</td>\n",
       "      <td>haml/haml</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 51 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   repo_id          repo_name  CheckRunEvent  CheckSuiteEvent  \\\n",
       "0       27  rubinius/rubinius            0.0              0.0   \n",
       "1       28        mojombo/god            0.0              0.0   \n",
       "2       68   macournoyer/thin            0.0              0.0   \n",
       "3      144    mojombo/chronic            0.0              0.0   \n",
       "4      426          haml/haml            0.0              0.0   \n",
       "\n",
       "   CommitCommentEvent  ContentReferenceEvent  CreateEvent  DeleteEvent  \\\n",
       "0                 0.0                    0.0          0.0          0.0   \n",
       "1                 0.0                    0.0          0.0          0.0   \n",
       "2                 0.0                    0.0          0.0          0.0   \n",
       "3                 0.0                    0.0          0.0          0.0   \n",
       "4                 0.0                    0.0          0.0          0.0   \n",
       "\n",
       "   DeployKeyEvent  DeploymentEvent  ...  RepositoryDispatchEvent  \\\n",
       "0             0.0              0.0  ...                      0.0   \n",
       "1             0.0              0.0  ...                      0.0   \n",
       "2             0.0              0.0  ...                      0.0   \n",
       "3             0.0              0.0  ...                      0.0   \n",
       "4             0.0              0.0  ...                      0.0   \n",
       "\n",
       "   RepositoryEvent  RepositoryImportEvent  RepositoryVulnerabilityAlertEvent  \\\n",
       "0              0.0                    0.0                                0.0   \n",
       "1              0.0                    0.0                                0.0   \n",
       "2              0.0                    0.0                                0.0   \n",
       "3              0.0                    0.0                                0.0   \n",
       "4              0.0                    0.0                                0.0   \n",
       "\n",
       "   SecurityAdvisoryEvent  StarEvent  StatusEvent  TeamEvent  TeamAddEvent  \\\n",
       "0                    0.0        0.0          0.0        0.0           0.0   \n",
       "1                    0.0        0.0          0.0        0.0           0.0   \n",
       "2                    0.0        0.0          0.0        0.0           0.0   \n",
       "3                    0.0        0.0          0.0        0.0           0.0   \n",
       "4                    0.0        0.0          0.0        0.0           0.0   \n",
       "\n",
       "   WatchEvent  \n",
       "0         6.0  \n",
       "1         1.0  \n",
       "2         1.0  \n",
       "3         3.0  \n",
       "4         1.0  \n",
       "\n",
       "[5 rows x 51 columns]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "repos.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#### Create the user, repo nodes and edges between them\n",
    "# \"MERGE\" request : creates a new node if it does not exist already\n",
    "\n",
    "tx = graph.begin(autocommit=False)\n",
    "\n",
    "user_statement = \"MERGE (a:`User`{user_id:{A}, user_name:{B}}) RETURN a\"\n",
    "for i, row in tqdm(users.iterrows(), total = len(users)):\n",
    "    tx.run(user_statement, {\"A\": row['user_id'], \"B\": row['user_name']})\n",
    "tx.commit()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 66475/66475 [45:21<00:00, 24.43it/s]  \n"
     ]
    }
   ],
   "source": [
    "tx = graph.begin(autocommit=False)\n",
    "\n",
    "repo_statement = \"MERGE (a:`Repo`{repo_id:{A}, repo_name:{B}}) RETURN a\"\n",
    "for i, row in tqdm(repos.iterrows(), total = len(repos)):\n",
    "    tx.run(repo_statement, {\"A\": row['repo_id'], \"B\": row['repo_name']})\n",
    "tx.commit()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 218939/218939 [06:59<00:00, 522.12it/s]\n"
     ]
    }
   ],
   "source": [
    "tx = graph.begin(autocommit=False)\n",
    "\n",
    "edge_statement1 = (\"MATCH (u:`User`{user_id:{A}}) \"\n",
    "                     \"MATCH (r:`Repo`{repo_id:{B}}) MERGE (u)-[e:`\")\n",
    "edge_statement2 =  \"`]->(r) RETURN e\"\n",
    "for i, row in tqdm(triplets.iterrows(), total = len(triplets)) :\n",
    "    edge_statement = edge_statement1 + row['event_type'] + edge_statement2\n",
    "    tx.run(edge_statement, {\"A\": row['user_id'], \"B\": row['repo_id']})\n",
    "    if i % 200 == 0:\n",
    "        tx.process()\n",
    "tx.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x132402d10>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run('CREATE INDEX ON :User(user_id)')\n",
    "graph.run('CREATE INDEX ON :Repo(repo_id)')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'u2.user_name': 'comxd', 'sim': 1.0},\n",
       " {'u2.user_name': 'altmer', 'sim': 1.0},\n",
       " {'u2.user_name': 'rajeshmeniya', 'sim': 1.0}]"
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_id = 100\n",
    "threshold = 0.5\n",
    "\n",
    "# In Strategy 1, the similarity between two users u1 and u2 is the proportion of starred repos they have in common\n",
    "# The score of one given movie m is the proportion of users similar to u1 who rated m\n",
    "\n",
    "query = (### Similarity normalization : count number of repos starred by u1 ###\n",
    "  # Count movies rated by u1 as countm\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`WatchEvent`]->(r1:`Repo`) '\n",
    "  'WITH count(r1) as count1 '\n",
    "  ### Score normalization : count number of users who are considered similar to u1 ###\n",
    "  # Retrieve all users u2 who share at least one starred repo with u1\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`WatchEvent`]->(r1:`Repo`) '\n",
    "  'MATCH (r1)<-[w:`WatchEvent`]-(u2:`User`) '\n",
    "  'WHERE NOT u2=u1 '\n",
    "  # Compute similarity\n",
    "  'WITH u2, count1, tofloat(count(w)) / count1 as sim '\n",
    "  # Keep users u2 whose similarity with u1 is above some threshold\n",
    "#   'WHERE sim>{threshold} '\n",
    "  # Compute score and return the list of suggestions ordered by score\n",
    "  'RETURN DISTINCT u2.user_name, sim ORDER BY sim DESC ')\n",
    "  \n",
    "tx = graph.begin()\n",
    "result = tx.run(query, {'user_id': user_id, 'threshold': threshold}).data()\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.024912118911743164"
      ]
     },
     "execution_count": 105,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "start = time.time()\n",
    "\n",
    "repo_id = 843222\n",
    "threshold = 1\n",
    "\n",
    "# Find similar repos\n",
    "\n",
    "query = (### Similarity normalization : count number of repos starred by u1 ###\n",
    "  # Count movies rated by u1 as countm\n",
    "  'MATCH (u1:`User`)-[:`WatchEvent`]->(r1:`Repo` {repo_id: {repo_id}}) '\n",
    "  'WITH count(u1) as count1 '\n",
    "  ### Score normalization : count number of users who are considered similar to u1 ###\n",
    "  # Retrieve all users u2 who share at least one starred repo with u1\n",
    "  'MATCH (u1:`User`)-[:`WatchEvent`]->(r1:`Repo` {repo_id: {repo_id}}) '\n",
    "  'MATCH (r2:`Repo`)<-[w:`WatchEvent`]-(u1) '\n",
    "  'WHERE NOT r1=r2 '\n",
    "  # Compute similarity\n",
    "#   'WITH r2, count1, tofloat(count(w)) / count1 as sim '\n",
    "  'WITH r2, count1, tofloat(count(w)) as sim '\n",
    "  # Keep users u2 whose similarity with u1 is above some threshold\n",
    "#   'WHERE sim>{threshold} '\n",
    "  # Compute score and return the list of suggestions ordered by score\n",
    "  'RETURN DISTINCT r2.repo_name, sim ORDER BY sim DESC ')\n",
    "  \n",
    "tx = graph.begin()\n",
    "result = tx.run(query, {'repo_id': repo_id, 'threshold': threshold}).data()\n",
    "result\n",
    "\n",
    "end = time.time()\n",
    "end-start"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "threshold = 0.5\n",
    "\n",
    "# In Strategy 1, the similarity between two users u1 and u2 is the proportion of starred repos they have in common\n",
    "# The score of one given movie m is the proportion of users similar to u1 who rated m\n",
    "\n",
    "query = (### Similarity normalization : count number of repos starred by u1 ###\n",
    "  # Count movies rated by u1 as countm\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`WatchEvent`]->(r1:`Repo`) '\n",
    "  'WITH count(r1) as count1 '\n",
    "  ### Score normalization : count number of users who are considered similar to u1 ###\n",
    "  # Retrieve all users u2 who share at least one starred repo with u1\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`WatchEvent`]->(r1:`Repo`) '\n",
    "  'MATCH (r1)<-[w:`WatchEvent`]-(u2:`User`) '\n",
    "  'WHERE NOT u2=u1 '\n",
    "  # Compute similarity\n",
    "  'WITH u2, count1, tofloat(count(w))/count1 as sim '\n",
    "  # Keep users u2 whose similarity with u1 is above some threshold\n",
    "  'WHERE sim>{threshold} '\n",
    "  # Count number of similar users as countu\n",
    "  'WITH count(u2) as count2, count1 '\n",
    "  ### Recommendation ###\n",
    "  # Retrieve all users u2 who share at least one movie with u1\n",
    "  'MATCH (u1:`User` {user_id:{user_id}})-[:`Has_rated`]->(m1:`Movie`) '\n",
    "  'MATCH (m1)<-[r:`Has_rated`]-(u2:`User`) '\n",
    "  'WHERE NOT u2=u1 '\n",
    "  # Compute similarity\n",
    "  'WITH u1, u2,countu, tofloat(count(r))/countm as sim '\n",
    "  # Keep users u2 whose similarity with u1 is above some threshold\n",
    "  'WHERE sim>{threshold} '\n",
    "  # Retrieve movies m that were rated by at least one similar user, but not by u1\n",
    "  'MATCH (m:`Movie`)<-[r:`Has_rated`]-(u2) '\n",
    "  'WHERE NOT (m)<-[:`Has_rated`]-(u1) '\n",
    "  # Compute score and return the list of suggestions ordered by score\n",
    "  'RETURN DISTINCT m, tofloat(count(r))/countu as score ORDER BY score DESC ')\n",
    "tx = graph.cypher.begin()\n",
    "tx.append(query, {'user_id': user_id, 'threshold': threshold})\n",
    "result = tx.commit()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (mit)",
   "language": "python",
   "name": "mit"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
